def thesaurus(*args) -> dict:
    """Возвращает словарь, в котором ключи — первые буквы имён, а значения — списки,
    содержащие имена, начинающиеся с соответствующей буквы."""
    dict_out_1 = {}
    for n in args:
        if n[0] in dict_out_1:
            a = dict_out_1[n[0]] 
            a = a.append(f'{n}')
        else:
            dict_out_1.setdefault (n[0], [n])
    return dict_out_1


print(thesaurus("Иван", "Мария", "Петр", "Илья"))

print('\n')


def keys_sort(d: dict) -> str:
    """Сортировка словаря по ключам через список"""
    '''Словари не очень подходят для упорядочивания, они являются неупорядоченными коллекциями произвольных объектов
В отличие от списка элементы, хранящиеся в словаре, не поддерживают какой-то определенный порядок; 
на самом деле для обеспечения быстрого поиска Python сохраняет их в псевдослучайном порядке. 
Ключи представляют символические (не физические) позиции элементов в словаре.
'''
    list_sort = []
    list_keys = list(d.keys())
    list_keys.sort()
    for i in list_keys:
        list_sort.append(f'{i} : {d[i]}')
        str_sort = '\n'.join(list_sort)
    return str_sort

print(keys_sort(thesaurus("Иван", "Мария", "Петр", "Илья")))

print('\n\n')


def thesaurus_adv(*args) -> dict:
    """Возвращает словарь, в котором ключи — первые буквы фамилий, а значения — словари,
    реализованные по схеме предыдущего задания и содержащие записи, в которых фамилия начинается с соответствующей буквы."""
    dict_out_2 = {}
    for n_1 in args:
        x = n_1.split()
        y = x[1]
        if y[0] in dict_out_2:
            b = dict_out_2[y[0]] 
            b = b.append(f'{n_1}')
        else:
            dict_out_2.setdefault (y[0], [n_1])
    for key in dict_out_2:
        dict_out_2[key] = thesaurus(*dict_out_2[key])
    return dict_out_2


print(thesaurus_adv("Иван Сергеев", "Инна Серова", "Петр Алексеев", "Илья Иванов", "Анна Савельева", "Елена Ачтотакможнова", 
"Игорь Какугоднов", "Алексей Ухахатов", "Мария Штукпятова", "Оксана Каксложнова", "Яков Идеикончилисов", "Константин Вообщарандомнов", 
"Вероника Придумывайдальшесамова"))

print('\n')

# для сортировки по ключам используем уже созданную функцию key_sort
print(keys_sort(thesaurus_adv("Иван Сергеев", "Инна Серова", "Петр Алексеев", "Илья Иванов", "Анна Савельева", "Елена Ачтотакможнова", 
"Игорь Какугоднов", "Алексей Ухахатов", "Мария Штукпятова", "Оксана Каксложнова", "Яков Идеикончилисов", "Константин Вообщарандомнов", 
"Вероника Придумывайдальшесамова")))