# Task_1_2_a
def sum_list_1(dataset: list) -> int:
# вводим переменные индекса int и конечной суммы чисел, 
# сумма цифр которых делится на 7 без остатка total_amount
    idx = 0 
    total_amount = 0
# цикл - пока значение idx меньше длины списка dataset, выполнять следующее
    while idx < len(dataset): 
# вводим переменную sum - в которой хранится значение суммы цифр
        sum = 0
# цикл - пока значение dataset[idx] не равно 0, выполнять следующее
        while dataset[idx] != 0:
# отбераем последнюю цифру путем деления с остатком на 10, и вписваем ее в переменную sum
            sum += dataset[idx] % 10
# убераем последнюю цифру путем целочисленного деления на 10, полученное значение вписываем в dataset[idx]
            dataset[idx] //= 10
# делаем проверку, делится ли полученное число на 7 без остатка, если да, то прибавляем число из списка 
# к значению переменной total_amount
            if (sum % 7 == 0):
                total_amount += dataset[idx]
# очередная проверка данной части кода)
    #dataset[idx] = sum
# прибавляем к значению idx 1, для перехода к след числу в списке
        idx += 1
#print(dataset)
# выводим конечный результат
    return(total_amount)



#task_1_2_b
def sum_list_2(dataset: list) -> int:
# вводим переменные индекса int и конечной суммы чисел, 
# сумма цифр которых делится на 7 без остатка total_amount
    idx = 0 
    total_amount = 0
# цикл - пока значение idx меньше длины списка dataset, выполнять следующее
    while idx < len(dataset): 
# вводим переменную sum - в которой хранится значение суммы цифр
        sum = 0
# цикл - пока значение dataset[idx] не равно 0, выполнять следующее
        while dataset[idx] != 0:
# отбераем последнюю цифру путем деления с остатком на 10, и вписваем ее в переменную sum
            sum += dataset[idx] % 10
# убераем последнюю цифру путем целочисленного деления на 10, полученное значение вписываем в dataset[idx]
            dataset[idx] //= 10
# делаем проверку, делится ли полученное число на 7 без остатка, если да, то прибавляем число из списка 
# к значению переменной total_amount
            if (sum % 7 == 0):
                total_amount += dataset[idx]
# очередная проверка данной части кода)
    #dataset[idx] = sum
# прибавляем к значению idx 1, для перехода к след числу в списке
        idx += 1
#print(dataset)
# выводим конечный результат
    return(total_amount)

my_list = []  # Соберите нужный список по заданию
for number in range(1, 1001, 2):
    number **= 3
# добавить значение переменной number в список my_list
    my_list.append(number)

my_list_1 = []  # Соберите нужный список по заданию
for number_1 in range(1, 1001, 2):
    number_1 = number_1 ** 3 + 17
# добавить значение переменной number в список my_list_1
    my_list_1.append(number_1)

result_1 = sum_list_1(my_list)
print(result_1)

result_2 = sum_list_2(my_list_1)
print(result_2)